OdDAI.Aggr.op_Assign(OdDAI.Aggr!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Temporary method for OdArray compatibility.

OdDAI.Aggr.getAggregationTypeIfExist
\details
Returns internal aggregation type if it exists.
\returns valid pointer of aggregation type for aggregate with complex(not POD) items, otherwise it returns nullptr.

OdDAI.Aggr.hasValue(System.Int32,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Performs an attempt to find value within aggregation.
\param startIndex  [in] Index to start search.
\param valueToFind [in] Value to find.
\returns Index of found item, or -1 if aggregation doesn't contain item with such value, starting from startIndex.

OdDAI.Aggr.checkValuesUniqueness
\details
Checks aggregate for duplicate values.
\returns true if all values in aggregate are unique, otherwise it returns false.

OdDAI.Aggr.copyFromAggr(OdDAI.Aggr!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy from aggregate.
\param otherAggr [in] aggregate to copy from.
\returns Returns true if copy was succeeded, otherwise false
\remarks
The copy should work between the same type aggregates.
In case with different aggregates types the function should be failed.

OdDAI.Aggr.empty
\details
Check aggregate for any elements.
\returns Returns true if aggregate is empty and false in otherwise.

OdDAI.Aggr.isMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Check if aggregate contains a member.
\param itemToCheck [in] an item to check.
\returns Returns true if aggregate contains a member and false in otherwise.

OdDAI.Aggr.getMemberCount
\details
Returns amount of aggregate elements.
\returns Returns an amount of aggregate elements.

OdDAI.Aggr.clear
\details
Clear the aggregate with deletion of all its content.

OdDAI.Aggr.getUpperBound
\details
Provides aggregates upper bound.
\returns Returns an aggregate upper bound.

OdDAI.Aggr.getLowerBound
\details
Provides aggregates lower bound.
\returns Returns an aggregate lower bound.

OdDAI.Aggr.createEmpty
\details
Initializes an aggregate. Creates an empty instance inside aggregate.
\returns Returns true if operation succeeded, in other case function  returns false.

OdDAI.Aggr.isOrdered
\details
Check if aggregate is ordered.
\returns Returns true if ordered, otherwise returns false.

OdDAI.Aggr.aggrType
\details
Returns a type of aggregate.
\returns Returns a type of aggregate.

OdDAI.Aggr.type
\details
Returns a value type of aggregate instance elements.
\returns Returns a value type of aggregate instance elements.

OdDAI.Aggr.nullify
\details
Clean the aggregate with deletion of all its content.

OdDAI.Aggr.isNil
\details
Checks if aggregate is unset.
\return Returns true if aggregate is unset.

OdDAI.Aggr.createConstIterator
\details
Creates a new const iterator along elements of aggregate.
\return Returns a shared pointer to the newly created const iterator.

OdDAI.Aggr.createIterator
\details
Creates a new iterator along elements of aggregate.
\return Returns a shared pointer to the newly created iterator.

OdDAI.Aggr.Dispose
\details
Non-virtual destructor!

OdDAI.Aggr
\details
A base class for containers defined within a schema.